In [10]:
import pandas as pd

df = pd.read_csv('city_sales.csv')
df

                       date  num    city
0       2015-01-01 09:00:00    4  London
1       2015-01-01 09:01:00    4  London
2       2015-01-01 09:02:00    3  London
3       2015-01-01 09:03:00    3  London
4       2015-01-01 09:04:00    3  London
...                     ...  ...     ...
376428  2018-06-06 09:54:00    3  London
376429  2018-06-06 09:55:00    3  London
376430  2018-06-06 09:56:00    3  London
376431  2018-06-06 09:57:00    3  London
376432  2018-06-06 09:58:00    1  London

[376433 rows x 3 columns]

In [12]:
df = df.set_index(['date'])

# Select data with a specific year and perform aggregation

In [11]:
df['date']=pd.to_datetime(df['date'])

In [13]:
df.loc['2018']

                     num    city
date
2018-01-01 09:00:00    2  London
2018-01-01 09:01:00    1  London
2018-01-01 09:02:00    3  London
2018-01-01 09:03:00    3  London
2018-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[47211 rows x 2 columns]

In [14]:
df.loc['2018','num'].sum()

np.int64(132127)

In [20]:
df.loc['2018'].groupby('city').sum()

           num
city
London  132127

In [21]:
df['city'].value_counts()

city
London    376433
Name: count, dtype: int64

In [22]:
cond = df.index.month==2
df[cond]

                     num    city
date
2015-02-02 09:00:00    4  London
2015-02-02 09:01:00    3  London
2015-02-02 09:02:00    3  London
2015-02-02 09:03:00    2  London
2015-02-02 09:04:00    1  London
...                  ...     ...
2018-02-28 15:56:00    3  London
2018-02-28 15:57:00    3  London
2018-02-28 15:58:00    3  London
2018-02-28 15:59:00    2  London
2018-02-28 16:00:00    3  London

[34101 rows x 2 columns]

In [25]:
import json

In [26]:
data = {
    "president": {
        "name": "Zaphod Beeblebrox",
        "species": "Betelgeusian"
    }
}

In [28]:
with open('data_json.json',"w") as f:
    json.dump(data,f)

In [31]:
with open('data_json.json',"r") as fr:
    data1= json.load(fr)

In [32]:
data

{'president': {'name': 'Zaphod Beeblebrox', 'species': 'Betelgeusian'}}

# Convert JSON to DataFrame Using read_json()

In [40]:
jsonStr = '''{"Index0":{"Courses": "Pandas","Discount": "1200"},
           "Index1":{"Courses": "Hadoop","Discount": "1500"},
           "Index2":{"Courses": "Spark","Discount": "1800"}
          }'''


df1 = pd.read_json(jsonStr)

C:\Users\Aruna Tangirala\AppData\Local\Temp\ipykernel_20708\1700429970.py:7: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df1 = pd.read_json(jsonStr)

In [41]:
df1

          Index0  Index1 Index2
Courses   Pandas  Hadoop  Spark
Discount    1200    1500   1800

In [43]:
df2 = pd.read_json(jsonStr,orient='index')

C:\Users\Aruna Tangirala\AppData\Local\Temp\ipykernel_20708\2836886739.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df2 = pd.read_json(jsonStr,orient='index')

In [44]:
df2

       Courses  Discount
Index0  Pandas      1200
Index1  Hadoop      1500
Index2   Spark      1800

# Convert Dict To DF

In [45]:
data

{'president': {'name': 'Zaphod Beeblebrox', 'species': 'Betelgeusian'}}

In [46]:
data['president']

{'name': 'Zaphod Beeblebrox', 'species': 'Betelgeusian'}

In [58]:
df3 = pd.DataFrame.from_dict(data['president'],orient='Index',columns=['President info'])

df5 =  pd.DataFrame.from_dict(data)

In [59]:
df3

            President info
name     Zaphod Beeblebrox
species       Betelgeusian

In [55]:
df5

                 president
name     Zaphod Beeblebrox
species       Betelgeusian

# Working with CSV files

In [94]:
df = pd.read_csv('hrdata.csv',index_col='Name',parse_dates=['Hire Date'])

C:\Users\Aruna Tangirala\AppData\Local\Temp\ipykernel_20708\779372171.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df = pd.read_csv('hrdata.csv',index_col='Name',parse_dates=['Hire Date'])

In [95]:
df

                Hire Date   Salary  Sick Days remaining
Name
Graham Chapman 2014-03-15  50000.0                   10
John Cleese    2015-06-01  65000.0                    8
Eric Idle      2014-05-12  45000.0                   10
Terry Jones    2013-11-01  70000.0                    3
Terry Gilliam  2014-08-12  48000.0                    7
Michael Palin  2013-05-23  66000.0                    8

In [96]:
fil = (df['Salary']== df['Salary'].max()) & (df['Sick Days remaining']== df['Sick Days remaining'].min())

df[fil]

             Hire Date   Salary  Sick Days remaining
Name
Terry Jones 2013-11-01  70000.0                    3

In [97]:
df

                Hire Date   Salary  Sick Days remaining
Name
Graham Chapman 2014-03-15  50000.0                   10
John Cleese    2015-06-01  65000.0                    8
Eric Idle      2014-05-12  45000.0                   10
Terry Jones    2013-11-01  70000.0                    3
Terry Gilliam  2014-08-12  48000.0                    7
Michael Palin  2013-05-23  66000.0                    8

In [105]:
fil2 = df['Salary'].min()
fil2

np.float64(45000.0)

In [102]:
df[df['Salary']==fil2]

           Hire Date   Salary  Sick Days remaining
Name
Eric Idle 2014-05-12  45000.0                   10